# =====================================================
# Brewfile - Configuração de ambiente de desenvolvimento
# =====================================================

# =====================================================
# SHELLS E FERRAMENTAS DE TERMINAL
# =====================================================
brew "fish"          # Shell moderno com autocompletions inteligentes
brew "starship"      # Prompt customizável e rápido para qualquer shell
brew "tmux"          # Multiplexador de terminal (múltiplas sessões em uma janela)

# =====================================================
# GERENCIADORES DE PACOTES E RUNTIME
# =====================================================
brew "nvm"           # Node Version Manager - gerencia múltiplas versões do Node.js
brew "corepack"      # Gerenciador de versões de empacotadores (yarn/npm/pnpm)

# =====================================================
# FERRAMENTAS DE DESENVOLVIMENTO GIT
# =====================================================
brew "gh"            # GitHub CLI - interaja com GitHub pelo terminal
brew "lazygit"       # Interface TUI para Git - simplifica operações git
brew "git-delta"     # Visualizador de diff melhorado para git

# =====================================================
# EDITORES E FERRAMENTAS DE TEXTO
# =====================================================
brew "bat"           # Alternativa ao 'cat' com syntax highlighting
brew "ripgrep"       # Alternativa rápida ao grep, escrita em Rust

# =====================================================
# FERRAMENTAS DE BUSCA E NAVEGAÇÃO
# =====================================================
brew "fd"            # Alternativa moderna ao comando 'find'
brew "fzf"           # Fuzzy finder - busca interativa de arquivos/comandos
brew "zoxide"        # Navegação inteligente entre diretórios (substitui cd)

# =====================================================
# UTILITÁRIOS DE REDE E API
# =====================================================
brew "httpie"        # Cliente HTTP amigável para linha de comando
brew "jq"            # Processador de JSON para linha de comando
brew "curl"          # Ferramenta para transferência de dados com URLs

# =====================================================
# UTILITÁRIOS DE SISTEMA
# =====================================================
brew "tree"          # Mostra diretórios em formato de árvore
brew "htop"          # Monitor de processos interativo
brew "tldr"          # Páginas de manual simplificadas com exemplos práticos
brew "watch"         # Executa comandos periodicamente, mostrando a saída

# =====================================================
# CLOUD E INFRAESTRUTURA
# =====================================================
brew "awscli"        # CLI oficial da Amazon Web Services
brew "terraform"     # Ferramenta de infraestrutura como código
brew "aws-cdk"       # AWS Cloud Development Kit
brew "aws-sam-cli"   # AWS Serverless Application Model
brew "aws-amplify-cli"  # Ou usar npm para instalar: npm install -g @aws-amplify/cli

# =====================================================
# APLICATIVOS GUI (CASKS)
# =====================================================

# Terminais e Editores
cask "iterm2"                # Terminal avançado para macOS
cask "visual-studio-code"    # Editor de código da Microsoft

# Ferramentas de Desenvolvimento
cask "docker"                # Plataforma de containerização
cask "beekeeper-studio"      # Cliente SQL e gerenciador de banco de dados
cask "insomnia"              # Cliente para testes de API REST

# Navegadores
cask "arc"                   # Navegador moderno baseado em Chromium

# Produtividade
cask "notion"                # Aplicativo all-in-one para notas e projetos
cask "notion-calendar"       # Calendário integrado com Notion
cask "slack"                 # Plataforma de comunicação para equipes
cask "asana"                 # Gerenciamento de projetos e tarefas
cask "raycast"               # Launcher e utilitário de produtividade

# Design e Colaboração
cask "figma"                 # Ferramenta de design de interface
cask "zoom"                  # Plataforma de videoconferência

# Utilitários
cask "swiftbar"              # Customização da barra de menus do macOS
cask "spark"                 # Cliente de email
cask "chatgpt"               # Cliente desktop para ChatGPT

# =====================================================
# FONTES
# =====================================================
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-hack-nerd-font"
